Revit 2027 API
BuiltInFailures.FabricFailures.NoSurfPatternOnWire Property
 Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSurfPatternOnWire { get; }
Public Shared ReadOnly Property NoSurfPatternOnWire As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSurfPatternOnWire {
	FailureDefinitionId^ get ();
}
static member NoSurfPatternOnWire : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace